In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

# 数学运算

## 1. Series

In [2]:
s = Series(np.random.rand(10))
s

0    0.802917
1    0.291993
2    0.180356
3    0.356925
4    0.121471
5    0.489350
6    0.854975
7    0.151979
8    0.176443
9    0.579071
dtype: float64

In [4]:
s.sort_values(ascending=False)

6    0.854975
0    0.802917
9    0.579071
5    0.489350
3    0.356925
1    0.291993
2    0.180356
8    0.176443
7    0.151979
4    0.121471
dtype: float64

In [6]:
s.sort_index(ascending=False)

9    0.579071
8    0.176443
7    0.151979
6    0.854975
5    0.489350
4    0.121471
3    0.356925
2    0.180356
1    0.291993
0    0.802917
dtype: float64

In [7]:
s.max()

0.8549745661045852

In [8]:
s.min()

0.12147135082852267

In [9]:
s1 = Series([1,2,3])
s2 = Series([4,5,6])

In [10]:
s1+s2 #根据index一一对应相加

0    5
1    7
2    9
dtype: int64

In [11]:
s1 = Series([1,2,3], index=['A', 'B', 'C'])
s2 = Series([4,5,6], index=['A', 'D', 'E'])
s1+s2  #只有索引A是相同但,所以相加等于

A    5.0
B    NaN
C    NaN
D    NaN
E    NaN
dtype: float64

In [12]:
s1 = Series([1,2,3], index=['A', 'B', 'C'])
s2 = Series([4,5,6], index=['D', 'A', 'E'])
s1+s2  #只有索引A是相同但,所以相加等于

A    6.0
B    NaN
C    NaN
D    NaN
E    NaN
dtype: float64

In [16]:
(s1+s2).sort_values(ascending=False)

A    6.0
B    NaN
C    NaN
D    NaN
E    NaN
dtype: float64

## 2. DataFrame

In [21]:
df = DataFrame(np.random.rand(20).reshape(4,5))
df

          0         1         2         3         4
0  0.822013  0.122017  0.822738  0.682857  0.881785
1  0.743685  0.664266  0.847150  0.848132  0.390655
2  0.111433  0.790598  0.435581  0.601366  0.091429
3  0.570830  0.319445  0.292871  0.815310  0.231053

In [23]:
df.sort_values(by=4)

          0         1         2         3         4
2  0.111433  0.790598  0.435581  0.601366  0.091429
3  0.570830  0.319445  0.292871  0.815310  0.231053
1  0.743685  0.664266  0.847150  0.848132  0.390655
0  0.822013  0.122017  0.822738  0.682857  0.881785

In [24]:
df.sort_values(by=3)

          0         1         2         3         4
2  0.111433  0.790598  0.435581  0.601366  0.091429
0  0.822013  0.122017  0.822738  0.682857  0.881785
3  0.570830  0.319445  0.292871  0.815310  0.231053
1  0.743685  0.664266  0.847150  0.848132  0.390655

In [25]:
df.sort_values(axis=1,by=1)

          4         1         0         2         3
0  0.881785  0.122017  0.822013  0.822738  0.682857
1  0.390655  0.664266  0.743685  0.847150  0.848132
2  0.091429  0.790598  0.111433  0.435581  0.601366
3  0.231053  0.319445  0.570830  0.292871  0.815310

In [26]:
df.sort_index()

          0         1         2         3         4
0  0.822013  0.122017  0.822738  0.682857  0.881785
1  0.743685  0.664266  0.847150  0.848132  0.390655
2  0.111433  0.790598  0.435581  0.601366  0.091429
3  0.570830  0.319445  0.292871  0.815310  0.231053

In [27]:
df.max() #get max every colum

0    0.822013
1    0.790598
2    0.847150
3    0.848132
4    0.881785
dtype: float64

In [28]:
df.mean()

0    0.561990
1    0.474081
2    0.599585
3    0.736916
4    0.398731
dtype: float64

In [29]:
df.describe()

              0         1         2         3         4
count  4.000000  4.000000  4.000000  4.000000  4.000000
mean   0.561990  0.474081  0.599585  0.736916  0.398731
std    0.318175  0.307796  0.278123  0.115197  0.344460
min    0.111433  0.122017  0.292871  0.601366  0.091429
25%    0.455980  0.270088  0.399903  0.662484  0.196147
50%    0.657257  0.491856  0.629159  0.749084  0.310854
75%    0.763267  0.695849  0.828841  0.823516  0.513438
max    0.822013  0.790598  0.847150  0.848132  0.881785

## 3. DataFrame Bining 数据分级

In [32]:
score_list = np.random.randint(30,100,20)
score_list

array([33, 89, 63, 53, 32, 73, 42, 90, 46, 52, 80, 41, 96, 42, 91, 55, 86,
       89, 93, 56])

In [33]:
bins=[30,59,79,100]

In [36]:
a = pd.cut(score_list, bins)

In [37]:
a.value_counts()

(30, 59]     10
(59, 79]      2
(79, 100]     8
dtype: int64

In [38]:
df = DataFrame()

In [41]:
df['student'] = [pd.util.testing.rands(5) for i in range(20)]
df['score'] = score_list
df

   student  score
0    V0owC     33
1    1kMhI     89
2    YdSjW     63
3    p6xUV     53
4    8OiD2     32
5    j0NoF     73
6    cPlqa     42
7    4bIbt     90
8    3GVv2     46
9    Ye0mx     52
10   yTPUl     80
11   hUrTe     41
12   Pgd4a     96
13   ilkHf     42
14   nPknI     91
15   lFu8B     55
16   3IV8R     86
17   9y331     89
18   Ql3KC     93
19   1Y7lB     56

In [44]:
df['bins'] = pd.cut(df['score'], bins=bins, labels=['bad','ok','good'])

In [45]:
df

   student  score  bins
0    V0owC     33   bad
1    1kMhI     89  good
2    YdSjW     63    ok
3    p6xUV     53   bad
4    8OiD2     32   bad
5    j0NoF     73    ok
6    cPlqa     42   bad
7    4bIbt     90  good
8    3GVv2     46   bad
9    Ye0mx     52   bad
10   yTPUl     80  good
11   hUrTe     41   bad
12   Pgd4a     96  good
13   ilkHf     42   bad
14   nPknI     91  good
15   lFu8B     55   bad
16   3IV8R     86  good
17   9y331     89  good
18   Ql3KC     93  good
19   1Y7lB     56   bad

## 4. GroupBy

In [46]:
!ls

NumpyLib.ipynb                   pandas-4.ipynb
data                             pandas.ipynb
df_io.csv                        python-data-science-intro-master
helloworld.ipynb                 two_array.npz
oen_array.npy                    x.pkl
pandas-3.ipynb

In [48]:
!ls ./data/

AMZN.csv           apply_demo.csv     iris.csv           top5.csv
BABA.csv           city_weather.csv   movie_metadata.csv train.csv
Pokemon.csv        demo_duplicate.csv sales-funnel.xlsx  usa_flights.csv

In [49]:
df = pd.read_csv('./data/city_weather.csv')

In [50]:
df

          date city  temperature  wind
0   03/01/2016   BJ            8     5
1   17/01/2016   BJ           12     2
2   31/01/2016   BJ           19     2
3   14/02/2016   BJ           -3     3
4   28/02/2016   BJ           19     2
5   13/03/2016   BJ            5     3
6   27/03/2016   SH           -4     4
7   10/04/2016   SH           19     3
8   24/04/2016   SH           20     3
9   08/05/2016   SH           17     3
10  22/05/2016   SH            4     2
11  05/06/2016   SH          -10     4
12  19/06/2016   SH            0     5
13  03/07/2016   SH           -9     5
14  17/07/2016   GZ           10     2
15  31/07/2016   GZ           -1     5
16  14/08/2016   GZ            1     5
17  28/08/2016   GZ           25     4
18  11/09/2016   SZ           20     1
19  25/09/2016   SZ          -10     4

In [51]:
g = df.groupby(df['city'])

In [52]:
g.groups

{'BJ': Int64Index([0, 1, 2, 3, 4, 5], dtype='int64'),
 'GZ': Int64Index([14, 15, 16, 17], dtype='int64'),
 'SH': Int64Index([6, 7, 8, 9, 10, 11, 12, 13], dtype='int64'),
 'SZ': Int64Index([18, 19], dtype='int64')}

In [53]:
g.get_group('SH')

          date city  temperature  wind
6   27/03/2016   SH           -4     4
7   10/04/2016   SH           19     3
8   24/04/2016   SH           20     3
9   08/05/2016   SH           17     3
10  22/05/2016   SH            4     2
11  05/06/2016   SH          -10     4
12  19/06/2016   SH            0     5
13  03/07/2016   SH           -9     5

In [55]:
g.groups['SH'][0]

6

In [56]:
g.get_group('SH').min()

date           03/07/2016
city                   SH
temperature           -10
wind                    2
dtype: object

In [58]:
h = g.get_group('SH') #by('temperature')

In [59]:
g.max()

            date  temperature  wind
city
BJ    31/01/2016           19     5
GZ    31/07/2016           25     5
SH    27/03/2016           20     5
SZ    25/09/2016           20     4